//
//  ViewController.swift
//  Quotation
//
//  Created by Hadi Nobakht on 10/6/16.
//  Copyright © 2016 Blanfordia. All rights reserved.
//

import UIKit

class ViewController: UIViewController {
    
    var quotation = [
        "برای خودتان صبوری به خرج دهید. رشدِ فردی شکننده است، مقدس است. هیچ سرمایه گذاری با ارزش تری وجود ندارد.",
        "پیش از آنکه کار بزرگی بکنید، باید انتظار آن را از خودتان داشته باشید.",
        "بهترین و زیباترین چیز های این دنیا را نه می توان دید و نه حتی می توان لمس کرد؛ باید آنها را با قلبتان احساس کنید.",
        "ما می دانیم چه هستیم، اما نمی دانیم چه می توانیم باشیم.",
        "بسیاری از شکست های زندگی متعلق به کسانی است که وقتی دست از تلاش بر می دارند نمی دانند چقدر به موفقیت نزدیک هستند.",
        "من به تنهایی نمی توانم دنیا را عوض کنم. اما می توانم سنگی در آب بیندازم و موج های زیادی درست کنم.",
        "با انجام کارهای لازم شروع کنید؛ سپس کارهای امکانپذیر را انجام دهید، و به یکباره خواهید دید در حال انجام غیر ممکن ها هستید.",
        "سعی کنید رنگین کمان هوای ابری کسی باشید.",
        "اجازه ندهید ترس شکست در شما قوی تر از هیجان پیروزی باشد.",
        "کسب و کار از دید من کت و شلوار پوشیدن و راضی نگه داشتن ذی نفعان نیست. این است که با خود و ایده هایتان روراست باشید و روی ضروریات تمرکز کنید.",
        "تمام رویاهای بزرگ با یک خیال پرداز شروع شده اند. همیشه به یاد داشته باشید توان، شکیبایی، علاقه و همت لازم برای تغییر دنیا را در وجود خود دارید.",
        "من نمی توانم جهت وزش باد را تغییر دهم، اما همیشه می توانم بادبان هایم را طوری تنظیم کنم که به مقصدم برسم.",
        "در نهایت تعداد سال های زندگی تان اهمیتی نخواهد داشت؛ آنچه اهمیت دارد زندگی این سالها خواهد بود.",
        "تنها راه کار بزرگ کردن این است که عاشق کاری که انجام می دهید باشید. اگر هنوز آن را نیافته اید، به جستجو ادامه دهید. آرام نگیرید. مثل همه ی کارهای دیگری که با قلبتان انجام می دهید، وقتی آن را بیابید خودتان خواهید فهمید.",
        "در کوچک ترین کارها نیز قلب، ذهن و روح خود را دخیل کنید. راز موفقیت همین است.",
        "دست یافتن به کمال امکانپذیر نیست. اما اگر به دنبال کمال باشیم، به تعالی خواهیم رسید.",
        "مهم ترین چیز این است که از زندگی تان لذت ببرید و خوشحال باشید؛ همین."
    ]
    
    
    @IBOutlet weak var lable: UILabel!

    override func viewDidLoad() {
        super.viewDidLoad()
        // Do any additional setup after loading the view, typically from a nib.
        
        lable.text = showAQuotation()
    }

    override func didReceiveMemoryWarning() {
        super.didReceiveMemoryWarning()
        // Dispose of any resources that can be recreated.
    }

    @IBAction func buttonPressed() {
        
        lable.text = showAQuotation()
    }
    
    func showAQuotation() -> String {
        let randomNumber = Int(arc4random_uniform(UInt32(quotation.count)))
        return quotation[randomNumber]

    }

}

